#自力で解けなかった
c = [list(map(int,input().split())) for _ in range(3)]

#1列目から2列目を引いた値がすべての行で等しいか
if (c[0][0] - c[0][1]) != (c[1][0] - c[1][1]) or (c[1][0] - c[1][1]) != (c[2][0] - c[2][1]):
    print("no")
    exit()
#2列目から3列目を引いた値がすべての行で等しいか
if (c[0][1] - c[0][2]) != (c[1][1] - c[1][2]) or (c[1][1] - c[1][2]) != (c[2][1] - c[2][2]):
    print("no")
    exit()
#1行目から2行目を引いた値がすべての列で等しいか
if (c[0][0] - c[1][0]) != (c[0][1] - c[1][1]) or (c[0][1] - c[1][1]) != (c[0][2] - c[1][2]):
    print("no")
    exit()
#2行目から3行目を引いた値がすべての列で等しいか
if (c[1][0] - c[2][0]) != (c[1][1] - c[2][1]) or (c[1][1] - c[2][1]) != (c[1][2] - c[2][2]):
    print("no")
    exit()

print("Yes")
exit()
  